#Область ОбработчикиСобытий
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимость();
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаКлиенте
Процедура ТипКонтрагентаПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимость()
	Если Объект.ТипКонтрагента = ПредопределенноеЗначение("Перечисление.ТипыКонтрагентов.Клиент") Тогда
		Элементы.ДатаРожденияКлиента.Видимость = Истина; 
		Элементы.КонтактныйТелефон.Видимость = Истина;
		Элементы.ПолКлиента.Видимость = Истина;  
		Элементы.Источник.Видимость = Истина;
		Элементы.ДоговорКонтрагента.Видимость = Ложь;
		Элементы.Наименование.Заголовок = "Ф.И.О.";
	Иначе
		Элементы.ДатаРожденияКлиента.Видимость = Ложь; 
		Элементы.ПолКлиента.Видимость = Ложь;  
		Элементы.Источник.Видимость = Ложь;
		Элементы.ДоговорКонтрагента.Видимость = Истина;
		Элементы.Наименование.Заголовок = "Наименование";
	КонецЕсли;
КонецПроцедуры
#КонецОбласти