Функция NewUserGET(Запрос)
	Логин = Строка(Запрос.ПараметрыЗапроса.Получить("username"));
	Телефон = Строка(Запрос.ПараметрыЗапроса.Получить("tel"));
	НовыйПользователь = ПользователиИнформационнойБазы.СоздатьПользователя();
	НовыйПользователь.Имя = Логин;
	НовыйПользователь.Роли.Добавить(Метаданные.Роли.ПолныеПрава);
	НовыйПользователь.Записать();
	
	НК = Справочники.Контрагенты.СоздатьЭлемент();
	НК.Наименование = Логин;
	НК.ТипКонтрагента = Перечисления.ТипыКонтрагентов.Клиент;
	НК.КонтактныйТелефон = Телефон;
	НК.Комментарий = "Контрагент зарегистрирован через мобильное приложение";
	НК.Записать();
	
	РП = Справочники.Пользователи.СоздатьЭлемент();
	РП.Код = НовыйПользователь.УникальныйИдентификатор;
	РП.Наименование = Логин;
	РП.Клиент = НК.Ссылка;
	РП.Записать();
	
	Ответ = Новый HTTPСервисОтвет(200);
	Возврат Ответ;
КонецФункции
